create view ETPORD.CLIENT as
SELECT   "FIELD_1",
            "FIELD_2",
            "FIELD_3",
            "FIELD_4",
            "FIELD_5",
            "FIELD_6",
            "FIELD_7",
            "FIELD_8",
            "FIELD_9",
            "FIELD_10",
            "FIELD_11",
            "FIELD_12",
            "FIELD_13",
            "FIELD_14",
            "FIELD_15",
            "INSERT_UPDATE_SEQ"
     FROM   CLIENT@coding
/

-- auto-generated definition
create database link CODING
    connect to APPS_USER identified by ?
    using 'CODING'
/



| FIELD\_1 | FIELD\_2 | FIELD\_3 | FIELD\_4 | FIELD\_5 | FIELD\_6 | FIELD\_7 | FIELD\_8 | FIELD\_9 | FIELD\_10 | FIELD\_11 | FIELD\_12 | FIELD\_13 | FIELD\_14 | FIELD\_15 | INSERT\_UPDATE\_SEQ |
| :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- |
| 1310 | احمد عفيفي احمد هلا ل | 1 | 40302 | 2 | 21 | 1 | مركز ههيا الشرقية | 1996-08-11 | احمدعفيفياحمدهلال | 13 | 10 | 4 | 2009-04-23 17:00:28 | null | 780351 |
| 13103 | عادل نبيل رجب عبد الرحمن | 1 | 203773 | 1 | 21 | 1 | 10ش سمير سيد احمد - المنيل | 1996-08-11 | عادلنبيلرجبعبدالرحمن | 1 | 10 | 4 | 2009-04-23 17:00:28 | null | 780352 |
| 13106 | عادل نجيب حنا | 1 | 122969 | 2 | 21 | 1 | شبرا | 1996-08-11 | عادلنجيبحنا | 1 | 10 | 4 | 2009-04-23 17:00:28 | null | 780353 |
| 13107 | عادل نجيب شاهين | 1 | 73720 | 2 | 21 | 1 | كفر الحضره منوفيه | 1996-08-11 | عادلنجيبشاهين | 17 | 10 | 4 | 2009-04-23 17:00:28 | null | 780354 |
| 13108 | عادل نجيب مجلي | 1 | 51611 | 2 | 21 | 1 | المعادي - طريق حلوان الزراعي | 1996-08-11 | عادلنجيبمجلي | 1 | 10 | 4 | 2005-09-19 22:59:19 | null | 1162082 |
| 13112 | عادل وصفي غالي حنا | 1 | 53485 | 2 | 21 | 1 | اسيوط | 1996-08-11 | عادلوصفيغاليحنا | 25 | 10 | 0 | 2009-04-23 17:00:28 | null | 4421855 |
| 13116 | عادل يسري وفقي دكروري | 1 | null | 1 | 21 | 1 | null | 1996-08-11 | عادليسريوفقيدكروري | null | 10 | 4 | 2007-05-18 01:01:01 | null | null |
| 13117 | عادل يوسف عبد العظيم عيسي | 1 | 38193 | 2 | 21 | 1 | 11 شارع درويش قسم الظاهر | 1996-08-11 | عادليوسفعبدالعظيمعيسي | 1 | 10 | 4 | null | null | 2536116 |
| 13118 | عادل يوسف مشرقي | 1 | 132032 | 2 | 21 | 1 | 16 ش احمد رافع - الساحل | 1996-08-11 | عادليوسفمشرقي | 1 | 10 | 4 | 2005-05-03 15:40:40 | null | 172715 |
| 13121 | عازر ميلا د عزيز | 1 | 32215 | 2 | 21 | 1 | منشيه الصدر | 1996-08-11 | عازرميلادعزيز | 1 | 10 | 4 | 2009-04-23 17:00:28 | null | 780357 |
| 13123 | عاشور احمد عاشور | 1 | 95192 | 1 | 21 | 1 | 40 ش محمد شاهين بولا ق | 1996-08-11 | عاشوراحمدعاشور | 1 | 10 | 4 | 2009-04-23 17:00:28 | null | 780358 |
| 13124 | عاشور ريان صابر | 1 | 82000 | 2 | 21 | 1 | 9 حارة سالم ش.الرمنتي بولا ق | 1996-08-11 | عاشورريانصابر | 21 | 10 | 4 | 2009-04-23 17:00:28 | null | 780359 |
| 13125 | عاشور سيد مجاهد يوسف | 1 | null | 1 | 21 | 1 | null | 1996-08-11 | عاشورسيدمجاهديوسف | null | 10 | 4 | 2007-05-18 01:01:01 | null | null |
| 13126 | عاشور عبد الحكيم سيد حسن | 1 | 53476 | 2 | 21 | 1 | ابو صيرة | 1996-08-11 | عاشورعبدالحكيمسيدحسن | 18 | 10 | 4 | 2009-04-23 17:00:28 | null | 780360 |
| 13127 | عاشور عبدالحميد خليل | 1 | 24401050102233 | 7 | 21 | 1 | 9 شارع الخشاب - روض الفرج - القاهره | 1996-08-11 | عاشورعبدالحميدخليل | 1 | 10 | 4 | 2007-09-20 12:19:17 | 1944-01-05 | 2238531 |
