create table ETPORD.ETP_SECURITIES
(
    SEC_SERIAL_ID       NUMBER       not null
        constraint ETP_SECURITIES_PK
            primary key,
    SEC_LIST_CURRENCY   NUMBER,
    SEC_TYPE            NUMBER
        constraint "ETP_SECURITIES_fk_type"
            references ETPORD.ETP_SEC_TYPE,
    SEC_ISIN_CODE       VARCHAR2(12) not null
        constraint UNQ_ISIN
            unique,
    SEC_EXT_CODE1       VARCHAR2(100),
    RUTERS_CODE         VARCHAR2(100),
    SEC_SHORT_NAME      VARCHAR2(100),
    SEC_NAME_AR         VARCHAR2(100),
    SEC_NAME_EN         VARCHAR2(100),
    LIST_DATE           DATE,
    DELIST_DATE         DATE,
    START_TRADE_DATE    DATE,
    END_TRADE_DATE      DATE,
    CLASS_CODE_1        VARCHAR2(50),
    CLASS_CODE_2        VARCHAR2(50),
    CLASS_CODE_3        VARCHAR2(50),
    ISSUE_DATE          DATE,
    ISSUED_BONDS        NUMBER(12),
    COUPON_INTER_RATE   NUMBER(7, 4),
    CALL_DATE           DATE,
    MATURITY_DATE       DATE,
    NUMBER_OF_YEARS     NUMBER(2),
    LAST_COUPON_PAYMENT DATE,
    NEXT_COUPON_PAYMENT DATE,
    NUMBER_OF_COUPONS   NUMBER(2),
    PARVALUE            NUMBER(7),
    BOND_STATUS         VARCHAR2(1),
    BOND_TYPE           NUMBER,
    UPDATE_DATE         DATE        default sysdate,
    UPDATE_USER         VARCHAR2(50 char),
    SPREADVALUE         NUMBER      default 0,
    YTM_BY_EXCEL        VARCHAR2(1) default 'N'
)
/

comment on column ETPORD.ETP_SECURITIES.SEC_TYPE is 'Bonds =1  bills = 2'
/

comment on column ETPORD.ETP_SECURITIES.YTM_BY_EXCEL is 'N By Database     Y By Excel'
/

| SEC\_SERIAL\_ID | SEC\_LIST\_CURRENCY | SEC\_TYPE | SEC\_ISIN\_CODE | SEC\_EXT\_CODE1 | RUTERS\_CODE | SEC\_SHORT\_NAME | SEC\_NAME\_AR | SEC\_NAME\_EN | LIST\_DATE | DELIST\_DATE | START\_TRADE\_DATE | END\_TRADE\_DATE | CLASS\_CODE\_1 | CLASS\_CODE\_2 | CLASS\_CODE\_3 | ISSUE\_DATE | ISSUED\_BONDS | COUPON\_INTER\_RATE | CALL\_DATE | MATURITY\_DATE | NUMBER\_OF\_YEARS | LAST\_COUPON\_PAYMENT | NEXT\_COUPON\_PAYMENT | NUMBER\_OF\_COUPONS | PARVALUE | BOND\_STATUS | BOND\_TYPE | UPDATE\_DATE | UPDATE\_USER | SPREADVALUE | YTM\_BY\_EXCEL |
| :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- |
| 175 | 1 | 1 | EGBGR02081F0 | null | EG021825=PD | سندات الخزانة المصرية 20 فبراير 2025 | سندات الخزانة المصرية 20 فبراير 2025 | Treasury Bonds  20 February 2025 | 2018-02-20 | 2025-02-20 | 2018-02-20 | 2025-02-20 | null | null | null | 2018-02-20 | 5602950000 | 14.5000 | null | 2025-02-20 | 7 | 2024-08-20 | 2025-02-20 | 2 | 1000 | 2 | null | 2025-02-20 14:33:31 | mtanany | 0 | N |
| 176 | 1 | 1 | EGBGR02061F2 | null | EG031821=PD | سندات الخزانة المصرية 20 مارس 2021 | سندات الخزانة المصرية 20 مارس 2021 | Treasury Bonds 20 March 2021 | 2018-03-20 | 2021-03-20 | 2018-03-20 | 2021-03-20 | null | null | null | 2018-03-20 | 9534437000 | 14.9500 | null | 2021-03-20 | 3 | 2020-09-20 | 2021-03-20 | 2 | 1000 | 2 | null | 2021-03-21 14:50:45 | mtanany | 0 | N |
| 177 | 1 | 1 | EGBGR02101F6 | null | EG041823=PD | سندات الخزانة المصرية 10 ابريل 2023 | سندات الخزانة المصرية 10 ابريل 2023 | Treasury Bonds  10 April 2023 | 2018-04-10 | 2023-04-10 | 2018-04-10 | 2023-04-10 | null | null | null | 2018-04-10 | 11614967000 | 14.8500 | null | 2023-04-10 | 5 | 2022-10-10 | 2023-04-10 | 2 | 1000 | 2 | null | 2023-04-10 13:38:34 | mbehairy | 0 | N |
| 178 | 1 | 1 | EGBGR02111F5 | null | EG051828=PD | سندات الخزانة المصرية 08 مايو 2028 | سندات الخزانة المصرية 08 مايو 2028 | Treasury Bonds 08 MAY 2028 | 2018-05-08 | 2028-05-08 | 2018-05-08 | 2028-05-08 | null | null | null | 2018-05-08 | 5170085000 | 14.9000 | null | 2028-05-08 | 10 | 2025-11-08 | 2026-05-08 | 2 | 1000 | 0 | null | 2024-04-21 11:09:44 | mtanany | 0 | N |
| 179 | 1 | 1 | EGBGR02091F9 | null | EG061821=PD | سندات الخزانة المصرية 12 يونيو 2021 | سندات الخزانة المصرية 12 يونيو 2021 | Treasury Bonds  12 June 2021 | 2018-06-12 | 2021-06-12 | 2018-06-12 | 2021-06-12 | null | null | null | 2018-06-12 | 4070725000 | 16.0000 | null | 2021-06-12 | 3 | 2020-12-12 | 2021-06-12 | 2 | 1000 | 2 | null | 2021-06-13 14:59:33 | mtanany | 0 | N |
| 180 | 1 | 1 | EGBGR02131F3 | null | EG071823=PD | سندات الخزانة المصرية 03 يوليو 2023 | سندات الخزانة المصرية 03 يوليو 2023 | Treasury Bonds  03 July 2023 | 2018-07-03 | 2023-07-03 | 2018-07-03 | 2023-07-03 | null | null | null | 2018-07-03 | 14825310000 | 17.6500 | null | 2023-07-03 | 5 | 2023-01-03 | 2023-07-03 | 2 | 1000 | 2 | null | 2020-12-16 13:51:34 | null | 0 | N |
| 181 | 1 | 1 | EGBGR02141F2 | null | EG081825=PD | سندات الخزانة المصرية 7 اغسطس 2025 | سندات الخزانة المصرية 7 اغسطس 2025 | Treasury Bonds  07 August 2025 | 2018-08-07 | 2025-08-07 | 2018-08-07 | 2025-08-07 | null | null | null | 2018-08-07 | 15363835000 | 17.7000 | null | 2025-08-07 | 7 | 2025-02-07 | 2025-08-07 | 2 | 1000 | 2 | null | 2025-08-07 15:29:25 | mtanany | 0 | N |
| 182 | 1 | 1 | EGBGR02171F9 | null | EG101823=PD | سندات الخزانة المصرية 09 أكتوبر 2023 | سندات الخزانة المصرية 09 أكتوبر 2023 | Treasury Bonds 09 October 2023 | 2018-10-09 | 2023-10-09 | 2018-10-09 | 2023-10-09 | null | null | null | 2018-10-09 | 14897015000 | 18.3500 | null | 2023-10-09 | 5 | 2023-04-09 | 2023-10-09 | 2 | 1000 | 2 | null | 2023-10-09 14:41:05 | mbehairy | 0 | N |
| 183 | 1 | 1 | EGBGR02181F8 | null | EG111828=PD | سندات الخزانة المصرية 06 نوفمبر 2028 | سندات الخزانة المصرية 06 نوفمبر 2028 | Treasury Bonds 06 November 2028 | 2018-11-06 | 2028-11-06 | 2018-11-06 | 2028-11-06 | null | null | null | 2018-11-06 | 9075678000 | 18.0000 | null | 2028-11-06 | 10 | 2025-11-06 | 2026-05-06 | 2 | 1000 | 0 | null | 2020-12-16 13:51:34 | null | 0 | N |
| 184 | 1 | 1 | EGBGR02161F0 | null | EG121821=PD | سندات الخزانة المصرية 11 ديسمبر 2021 | سندات الخزانة المصرية 11 ديسمبر 2021 | Treasury Bonds  11 December 2021 | 2018-12-11 | 2021-12-11 | 2018-12-11 | 2021-12-11 | null | null | null | 2018-12-11 | 16077730000 | 18.1500 | null | 2021-12-11 | 3 | 2021-06-11 | 2021-12-11 | 2 | 1000 | 2 | null | 2021-12-12 14:36:52 | mtanany | 0 | N |
| 185 | 1 | 1 | EGBGR02261F8 | null | EG041926=PD | سندات الخزانة المصرية 02 ابريل 2026 | سندات الخزانة المصرية 02 ابريل 2026 | Treasury Bonds 02 April 2026 | 2019-04-02 | 2026-04-02 | 2019-04-02 | 2026-04-02 | null | null | null | 2019-04-02 | 18157065000 | 16.5000 | null | 2026-04-02 | 7 | 2025-10-02 | 2026-04-02 | 2 | 1000 | 0 | null | 2024-01-02 14:58:37 | mtanany | 0 | N |
| 186 | 1 | 1 | EGBGR02251F9 | null | EG041924=PD | سندات الخزانة المصرية 09 ابريل 2024 | سندات الخزانة المصرية 09 ابريل 2024 | Treasury Bonds 09 April 2024 | 2019-04-09 | 2024-04-09 | 2019-04-09 | 2024-04-09 | null | null | null | 2019-04-09 | 9093716000 | 16.3000 | null | 2024-04-09 | 5 | 2023-10-09 | 2024-04-09 | 2 | 1000 | 2 | null | 2024-04-15 15:09:52 | mbehairy | 0 | N |
| 187 | 1 | 1 | EGBGR02271F7 | null | EG051929=PD | سندات الخزانة المصرية 07 مايو 2029 | سندات الخزانة المصرية 07 مايو 2029 | Treasury Bonds 07 MAY 2029 | 2019-05-07 | 2029-05-07 | 2019-05-07 | 2029-05-07 | null | null | null | 2019-05-07 | 22121666000 | 16.1000 | null | 2029-05-07 | 10 | 2025-11-07 | 2026-05-07 | 2 | 1000 | 0 | null | 2023-09-12 15:30:00 | mtanany | 0 | N |
| 188 | 1 | 1 | EGBGR02241F0 | null | EG061922=PD | سندات الخزانة المصرية 11 يونيو 2022 | سندات الخزانة المصرية 11 يونيو 2022 | Treasury Bonds  11 JUN 2022 | 2019-06-11 | 2022-06-11 | 2019-06-11 | 2022-06-11 | null | null | null | 2019-06-11 | 36607435000 | 16.0000 | null | 2022-06-11 | 3 | 2021-12-11 | 2022-06-11 | 2 | 1000 | 2 | null | 2022-06-12 14:30:32 | mtanany | 0 | N |
| 189 | 1 | 1 | EGBGR02291F5 | null | EG071924=PD | سندات الخزانة المصرية 02 يوليو 2024 | سندات الخزانة المصرية 02 يوليو 2024 | Treasury Bonds  02 JUL 2024 | 2019-07-02 | 2024-07-02 | 2019-07-02 | 2024-07-02 | null | null | null | 2019-07-02 | 43973150000 | 15.9000 | null | 2024-07-02 | 5 | 2024-01-02 | 2024-07-02 | 2 | 1000 | 2 | null | 2024-07-02 15:27:12 | mbehairy | 0 | N |
| 190 | 1 | 1 | EGBGR02301F2 | null | EG081926=PD | سندات الخزانة المصرية 06 أغسطس 2026 | سندات الخزانة المصرية 06 أغسطس 2026 | Treasury Bonds  06 AUG 2026 | 2019-08-06 | 2026-08-06 | 2019-08-06 | 2026-08-06 | null | null | null | 2019-08-06 | 15414427000 | 15.6000 | null | 2026-08-06 | 7 | 2025-08-06 | 2026-02-06 | 2 | 1000 | 0 | null | 2020-12-16 13:51:34 | null | 0 | N |
| 191 | 1 | 1 | EGBGR02281F6 | null | EG091922=PD | سندات الخزانة المصرية 03 سبتمبر 2022 | سندات الخزانة المصرية 03 سبتمبر 2022 | Treasury Bonds  03 SEP 2022 | 2019-09-03 | 2022-09-03 | 2019-09-03 | 2022-09-03 | null | null | null | 2019-09-03 | 32621565000 | 14.3000 | null | 2022-09-03 | 3 | 2022-03-03 | 2022-09-03 | 2 | 1000 | 2 | null | 2022-09-04 14:41:38 | mbehairy | 0 | N |
| 192 | 1 | 1 | EGBGR02341F8 | null | EG091929=PD | سندات الخزانة المصرية 10 سبتمبر 2029 | سندات الخزانة المصرية 10 سبتمبر 2029 | Treasury Bonds  10 SEP 2029 | 2019-09-10 | 2029-09-10 | 2019-09-10 | 2029-09-10 | null | null | null | 2019-09-10 | 19080960000 | 14.4000 | null | 2029-09-10 | 10 | 2025-09-10 | 2026-03-10 | 2 | 1000 | 0 | null | 2020-12-16 13:51:35 | null | 0 | N |
| 193 | 1 | 1 | EGBGR02331F9 | null | EG091924=PD | سندات الخزانة المصرية 10 سبتمبر 2024 | سندات الخزانة المصرية 10 سبتمبر 2024 | Treasury Bonds  10 SEP 2024 | 2019-09-10 | 2024-09-10 | 2019-09-10 | 2024-09-10 | null | null | null | 2019-09-10 | 32133352000 | 14.3500 | null | 2024-09-10 | 5 | 2024-03-10 | 2024-09-10 | 2 | 1000 | 2 | null | 2024-09-10 14:40:01 | mbehairy | 0 | N |
| 194 | 1 | 1 | EGBGR02371F5 | null | EG101926=PD | سندات الخزانة المصرية 15 أكتوبر 2026 | سندات الخزانة المصرية 15 أكتوبر 2026 | Treasury Bonds  15 October 2026 | 2019-10-15 | 2026-10-15 | 2019-10-15 | 2026-10-15 | null | null | null | 2019-10-15 | 17394832000 | 14.2170 | null | 2026-10-15 | 7 | 2025-10-15 | 2026-04-15 | 2 | 1000 | 0 | null | 2020-12-16 13:51:35 | null | 0 | N |
| 195 | 1 | 1 | EGBGR02381F4 | null | EG101922=PD | سندات الخزانة المصرية 15 أكتوبر 2022 | سندات الخزانة المصرية 15 أكتوبر 2022 | Treasury Bonds  15 October 2022 | 2019-10-15 | 2022-10-15 | 2019-10-15 | 2022-10-15 | null | null | null | 2019-10-15 | 5000000000 | 14.3650 | null | 2022-10-15 | 3 | 2022-04-15 | 2022-10-15 | 2 | 1000 | 2 | null | 2022-10-16 14:38:41 | null | 0 | N |
| 196 | 1 | 1 | EGBGR02391F3 | null | EG101924=PD | سندات الخزانة المصرية 22 أكتوبر 2024 | سندات الخزانة المصرية 22 أكتوبر 2024 | Treasury Bonds  22 OCT 2024 | 2019-10-22 | 2024-10-22 | 2019-10-22 | 2024-10-22 | null | null | null | 2019-10-22 | 5000000000 | 14.3390 | null | 2024-10-22 | 5 | 2024-04-22 | 2024-10-22 | 2 | 1000 | 2 | null | 2024-10-22 14:44:45 | mbehairy | 0 | N |
| 197 | 1 | 1 | EGBGR02431F7 | null | EG111924=PD | سندات الخزانة المصرية 19 نوفمبر 2024 | سندات الخزانة المصرية 19 نوفمبر 2024 | Treasury Bonds  19 November 2024 | 2019-11-19 | 2024-11-19 | 2019-11-19 | 2024-11-19 | null | null | null | 2019-11-19 | 5559587000 | 13.8370 | null | 2024-11-19 | 5 | 2024-05-19 | 2024-11-19 | 2 | 1000 | 2 | null | 2024-11-19 15:08:24 | mbehairy | 0 | N |
| 198 | 1 | 1 | EGBGR02421F8 | null | EG111922=PD | سندات الخزانة المصرية 26 نوفمبر 2022 | سندات الخزانة المصرية 26 نوفمبر 2022 | Treasury Bonds  26 November 2022 | 2019-11-26 | 2022-11-26 | 2019-11-26 | 2022-11-26 | null | null | null | 2019-11-26 | 18512000000 | 13.8630 | null | 2022-11-26 | 3 | 2022-05-26 | 2022-11-26 | 2 | 1000 | 2 | null | 2022-11-27 14:59:03 | mtanany | 0 | N |
| 199 | 1 | 1 | EGBGR02441F6 | null | EG121929=PD | سندات الخزانة المصرية 31 ديسمبر 2029 | سندات الخزانة المصرية 31 ديسمبر 2029 | Treasury Bonds  31 December 2029 | 2019-12-31 | 2029-12-31 | 2019-12-31 | 2029-12-31 | null | null | null | 2019-12-31 | 11750000000 | 13.7030 | null | 2029-12-31 | 10 | 2025-12-31 | 2026-06-30 | 2 | 1000 | 0 | null | 2020-12-16 13:51:35 | null | 0 | N |
| 200 | 1 | 1 | EGBGR02451F5 | null | EG012023=PD | سندات الخزانة المصرية 07 يناير 2023 | سندات الخزانة المصرية 07 يناير 2023 | Treasury Bonds  07 JAN 2023 | 2020-01-08 | 2023-01-07 | 2020-01-08 | 2023-01-07 | null | null | null | 2020-01-07 | 10254606000 | 13.7210 | null | 2023-01-07 | 3 | 2022-07-07 | 2023-01-07 | 2 | 1000 | 2 | null | 2023-01-09 14:55:23 | mtanany | 0 | N |
| 201 | 1 | 1 | EGBGR02481F2 | null | EG012027=PD | سندات الخزانة المصرية 07 يناير 2027 | سندات الخزانة المصرية 07 يناير 2027 | Treasury Bonds  07 JAN 2027 | 2020-01-08 | 2027-01-07 | 2020-01-08 | 2027-01-07 | null | null | null | 2020-01-07 | 14603846000 | 13.7710 | null | 2027-01-07 | 7 | 2026-01-07 | 2026-07-07 | 2 | 1000 | 0 | null | 2020-12-16 13:51:35 | null | 0 | N |
